# Contents
 - packages
 - Rename Column/Row names

#### organizing
 - plt 옵션들
 - apply
 - df concat
 - column type change

# Packages

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

# Rename Column/Row names

In [16]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=['col_a', 'col_b', 'col_c'], index=['row_a', 'row_b'])
df

       col_a  col_b  col_c
row_a      1      2      3
row_b      4      5      6

In [17]:
df.rename(columns = {'col_a':'aa', 'col_b':'bb'},
          index={'row_a':'raa'},
          inplace=True)
df

       aa  bb  col_c
raa     1   2      3
row_b   4   5      6

# plt

In [54]:
import random
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

dt = pd.Series(list(range(20210101,20210106)))
val_a = pd.Series(random.sample(range(10,99), 5))
val_b = pd.Series(random.sample(range(500,999),5))
df = pd.DataFrame({'dt':dt, 'val_a':val_a, 'val_b':val_b})
df

         dt  val_a  val_b
0  20210101     48    768
1  20210102     49    683
2  20210103     22    523
3  20210104     23    829
4  20210105     42    856

In [55]:
df.melt()

   variable     value
0        dt  20210101
1        dt  20210102
2        dt  20210103
3        dt  20210104
4        dt  20210105
5     val_a        48
6     val_a        49
7     val_a        22
8     val_a        23
9     val_a        42
10    val_b       768
11    val_b       683
12    val_b       523
13    val_b       829
14    val_b       856

In [ ]:
plt.figure(figsize=(16,4))